# Final Project Submission

Please fill out:
* Student name: Lewis Gathua Kamindu
* Student pace: Full Time
* Scheduled project review date/time: Friday 15th September, 2023.
* Instructor name: 
* Blog post URL:

## 1. Data Extraction & Understanding

We have been provided with six sources of data including 'csv' and 'SQL' data. In this section, we will explore this data and find out it's characteristics and what information we can extract from it.

Importing packages.

In [885]:
# Your code here - remember to use markdown cells for comments as well!
import pandas as pd
import sqlite3

### Box Office Movies

In [886]:
bom_movies = pd.read_csv('zippedData/bom.movie_gross.csv.gz')

bom_movies.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [887]:
bom_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

### The Movie Database (TMDB)

In [888]:
tmdb_movies = pd.read_csv('zippedData/tmdb.movies.csv.gz')

tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [889]:
tmdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

### The Numbers Movie Budgets

In [890]:
movie_budgets = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [891]:
movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

### Rotten Tomatoes Movie Information

In [892]:
rt_movie_info = pd.read_csv('zippedData/rt.movie_info.tsv.gz', delimiter='\t')

rt_movie_info.tail()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [893]:
rt_movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

### Rotten Tomatoes Reviews

In [894]:
rt_movie_reviews = pd.read_csv('zippedData/rt.reviews.tsv.gz', encoding='unicode_escape', sep='\t')

rt_movie_reviews.tail()

,id,review,rating,fresh,critic,top_critic,publisher,date
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [895]:
rt_movie_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

### Internet Movie Database (IMDB)

In [896]:
conn = sqlite3.connect('zippedData/im.db/im.db')

imdb_tables = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)

imdb_tables

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [897]:
movie_basics = pd.read_sql("""select * from movie_basics""", conn)

movie_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [898]:
movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [899]:
movie_ratings = pd.read_sql("""select * from movie_ratings""", conn)

movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [900]:
movie_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

## 2. Data Transformation

This stage will include Data Cleaning, Combining and Aggregating our data.

### Data Cleaning

Here, we will select the data that we require from these sources to complete our objectives. We will then remove unwanted data which could be in the form of:
* Null values
* Duplicates
* Outliers

We will begin by dropping columns we will not use and drop null values in columns we will need.

#### IMDB Data Cleaning

In [901]:
# Drop original_title, runtime_minutes from movie_basics

movie_basics.drop(columns=['original_title', 'runtime_minutes'], inplace=True)

# Remove rows with Null values on the genres column from movie_basics

movie_basics.dropna(subset=['genres'], inplace=True)

# Inspect movie basics

movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 140736 entries, 0 to 146143
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   movie_id       140736 non-null  object
 1   primary_title  140736 non-null  object
 2   start_year     140736 non-null  int64
 3   genres         140736 non-null  object
dtypes: int64(1), object(3)
memory usage: 5.4+ MB

In [902]:

movie_basics.head()

,movie_id,primary_title,start_year,genres
0,tt0063540,Sunghursh,2013,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,2019,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,2018,Drama
3,tt0069204,Sabse Bada Sukh,2018,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,2017,"Comedy,Drama,Fantasy"

#### RT Data Cleaning

In [903]:
#Drop unwanted columns from rt_movie_reviews

rt_movie_reviews.drop(columns=['fresh', 'critic', 'top_critic', 'publisher', 'date'], inplace=True)

#Drop rows with null values from review and rating columns

rt_movie_reviews.dropna(subset=['review', 'rating'], inplace=True)

#Inspect rt_movie_reviews

rt_movie_reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 35379 entries, 0 to 54424
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35379 non-null  int64
 1   review  35379 non-null  object
 2   rating  35379 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [904]:
# Preview rt_movie_reviews

rt_movie_reviews.head()

    id                                             review rating
0    3  A distinctly gallows take on contemporary fina...    3/5
6    3  Quickly grows repetitive and tiresome, meander...      C
7    3  Cronenberg is not a director to be daunted by ...    2/5
11   3  While not one of Cronenberg's stronger films, ...     B-
12   3  Robert Pattinson works mighty hard to make Cos...    2/4

In [905]:
# Repeat the process for remaining data sets

rt_movie_info.drop(columns=['director', 'writer', 'theater_date', 'dvd_date', 'runtime', 'box_office', 'synopsis', 'studio', 'currency'], inplace=True)

# Drop rows with Null values in rating and genre

rt_movie_info.dropna(subset=['rating', 'genre'])

# Inspect rt_movie_info

rt_movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      1560 non-null   int64
 1   rating  1557 non-null   object
 2   genre   1552 non-null   object
dtypes: int64(1), object(2)
memory usage: 36.7+ KB

In [906]:
# Preview rt_movie_info

rt_movie_info.head()

   id rating                                genre
0   1      R  Action and Adventure|Classics|Drama
1   3      R    Drama|Science Fiction and Fantasy
2   5      R    Drama|Musical and Performing Arts
3   6      R           Drama|Mystery and Suspense
4   7     NR                        Drama|Romance

#### TMDB Data Cleaning

In [907]:
# Drop columns that we will not be using for analysis.

tmdb_movies.drop(columns=['original_title', 'genre_ids', 'id'], inplace=True)

# Convert the release_date column to datetime

tmdb_movies['release_date'] = pd.to_datetime(tmdb_movies['release_date'])

# Inspect tmdb_movies

tmdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   original_language  26517 non-null  object
 2   popularity         26517 non-null  float64
 3   release_date       26517 non-null  datetime64[ns]
 4   title              26517 non-null  object
 5   vote_average       26517 non-null  float64
 6   vote_count         26517 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 1.4+ MB

In [908]:
# Preview tmdb_movies

tmdb_movies.head()

,Unnamed: 0,original_language,popularity,release_date,title,vote_average,vote_count
0,0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,en,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,en,28.005,1995-11-22,Toy Story,7.9,10174
4,4,en,27.920,2010-07-16,Inception,8.3,22186

#### Box Office Movies Data Cleaning

In [909]:
# Convert the foreign_gross column to float

bom_movies['foreign_gross'] = bom_movies['foreign_gross'].str.replace(r'\D', '').astype(float)

# Inspect bom_movies

bom_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   float64
 4   year            3387 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 132.4+ KB

Create a column 'revenue' in Box Office Movies that sums domestic & foreign gross.

In [910]:
# Create revenue column

bom_movies['revenue'] = bom_movies['domestic_gross'] + bom_movies['foreign_gross']

# Preview bom_movies

bom_movies.head()

,title,studio,domestic_gross,foreign_gross,year,revenue
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,9.603000e+08
3,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08

#### The Numbers Movie Budgets Data Cleaning

In [911]:
# Remove unwanted characters from columns and convert to float

movie_budgets['production_budget'] = movie_budgets['production_budget'].str.replace(r'\D', '').astype(float)

movie_budgets['domestic_gross'] = movie_budgets['domestic_gross'].str.replace(r'\D', '').astype(float)

movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].str.replace(r'\D', '').astype(float)

# Inspect movie_budgets

movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   float64
 4   domestic_gross     5782 non-null   float64
 5   worldwide_gross    5782 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 271.2+ KB

In [912]:
# Preview movie_budgets

movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000.0,760507625.0,2.776345e+09
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09
2,3,"Jun 7, 2019",Dark Phoenix,350000000.0,42762350.0,1.497624e+08
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09

### Data Merging & Aggregation

The cleaned data can now be combined, grouped and merged as required.

#### RT Data Merging

In [913]:
# rt_movie_reviews = rt_movie_reviews[~rt_movie_reviews['rating'].str.contains("[a-zA-Z]").fillna(False)]

# rt_movie_reviews['rating']

In [914]:
# rt_movie_reviews['rate'] = rt_movie_reviews['rating'].map(lambda x: x.split('/'))

# rt_movie_reviews['rate'].tail(20)

In [915]:
# rt_1 = rt_movie_reviews['rate'].explode()

# rt_1 = rt_1[~rt_1.str.contains('-').fillna(False)]

# rt_1.apply(lambda x: float(x))

# rt_1.reset_index(drop=True,inplace=True)

# rt_1

#### IMDB Data Merging

Here we set a common index for data extracted from IMDB and joined the data.

In [916]:
# Set Index in movie_basics to movie_id

movie_basics.set_index('movie_id', inplace=True)

movie_basics.head()

                             primary_title  start_year                genres
movie_id
tt0063540                        Sunghursh        2013    Action,Crime,Drama
tt0066787  One Day Before the Rainy Season        2019       Biography,Drama
tt0069049       The Other Side of the Wind        2018                 Drama
tt0069204                  Sabse Bada Sukh        2018          Comedy,Drama
tt0100275         The Wandering Soap Opera        2017  Comedy,Drama,Fantasy

In [917]:
# Set Index in movie_ratings to movie_id

movie_ratings.set_index('movie_id', inplace=True)

movie_ratings.head()

            averagerating  numvotes
movie_id
tt10356526            8.3        31
tt10384606            8.9       559
tt1042974             6.4        20
tt1043726             4.2     50352
tt1060240             6.5        21

In [918]:
# Join movie_basics and movie_ratings using an outer join. Clean rows with null values.

imdb_joined = movie_basics.join(movie_ratings, how='outer')

imdb_joined.dropna(inplace=True)

# Inspect imdb_joined

imdb_joined.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73052 entries, tt0063540 to tt9916160
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   primary_title  73052 non-null  object
 1   start_year     73052 non-null  float64
 2   genres         73052 non-null  object
 3   averagerating  73052 non-null  float64
 4   numvotes       73052 non-null  float64
dtypes: float64(3), object(2)
memory usage: 3.3+ MB

In [919]:
# Preview imdb_joined

imdb_joined.head()

,primary_title,start_year,genres,averagerating,numvotes
movie_id,,,,,
tt0063540,Sunghursh,2013.0,"Action,Crime,Drama",7.0,77.0
tt0066787,One Day Before the Rainy Season,2019.0,"Biography,Drama",7.2,43.0
tt0069049,The Other Side of the Wind,2018.0,Drama,6.9,4517.0
tt0069204,Sabse Bada Sukh,2018.0,"Comedy,Drama",6.1,13.0
tt0100275,The Wandering Soap Opera,2017.0,"Comedy,Drama,Fantasy",6.5,119.0

#### Group the Box Office Movies data

In [942]:
# Required columns are studio and revenue

bom_studio_revenue = bom_movies[['studio','revenue']]

# Group by Studio and use the mean aggregate function

bom_studio_revenue = bom_studio_revenue.groupby('studio').mean()

# Sort the values in descending order

bom_studio_revenue.sort_values('revenue', ascending=False, inplace=True)

# Drop duplicates

bom_studio_revenue.drop_duplicates(inplace=True)

# Preview the first 10 values

bom_studio_revenue.head(10)

               revenue
studio
HC        8.703000e+08
P/DW      5.076500e+08
BV        4.249078e+08
GrtIndia  2.542000e+08
WB        2.368577e+08
WB (NL)   2.344114e+08
Fox       2.311968e+08
Sony      2.133782e+08
Par.      2.068532e+08
Uni.      2.065753e+08

## 3. Stats and Measures

We will derive a few statistics that will help inform our business recommendations.

We will calculate the average budget required for movie production and the average revenue expected from movie earnings

In [944]:
# Average production budget

avg_budget = movie_budgets['production_budget'].mean()

avg_budget

31587757.0965064

In [945]:
# Average revenue

avg_revenue = movie_budgets['worldwide_gross'].mean()

avg_revenue

91487460.90643376